app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
---
	def show  #route can receive parameter of id - passed to show action
  	@post = Post.find(params[:id])